perf/ping.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
      - name: Ramp 
        duration: 30
        arrivalRate: 10
        rampTo: 150
      - name: Plain
        duration: 60
        arrivalRate: 150
      - name: Cool Down
        duration: 30
        arrivalRate: 150
        rampTo: 10

scenarios:
  - name: Ping
    flow:
      - get:
          url: '/ping'