perf/ping.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
      - duration: 30
        arrivalRate: 1
        rampTo: 5
        name: Warm up phase
      - duration: 60
        arrivalRate: 5
        name: Plain 5
      - duration: 30
        arrivalRate: 5
        rampTo: 10
        name: Ramp up load
      - duration: 60
        arrivalRate: 10
        name: Plain 10
      - duration: 30
        arrivalCount: 3
        name: Cool down

scenarios:
  - name: Ping
    flow:
      - get:
          url: '/ping'