perf/ping.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 20
    - name: Plain
      duration: 60
      arrivalRate: 20
    - name: Cool Down
      duration: 30
      arrivalRate: 20
      rampTo: 1
      
    
scenarios:
  - name: Ping
    flow:
      - get:
          url: '/ping'