perf/quote.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
      - duration: 30
        arrivalRate: 1
        rampTo: 10
        name: Warm up phase
      - duration: 30
        arrivalRate: 10
        name: Plain 10
      - duration: 30
        arrivalRate: 10
        rampTo: 15
        name: Ramp up load
      - duration: 30
        arrivalRate: 15
        name: Plain 15
      - duration: 50
        arrivalCount: 5
        name: Cool down

scenarios:
  - name: Quote
    flow:
      - get:
          url: '/quote'