perf/spaceflight_news.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
      - duration: 30
        arrivalRate: 1
        rampTo: 20
        name: Warm up phase
      - duration: 30
        arrivalRate: 20
        name: Plain 20
      - duration: 30
        arrivalRate: 20
        rampTo: 25
        name: Ramp up load
      - duration: 30
        arrivalRate: 25
        name: Plain 25
      - duration: 30
        arrivalCount: 5
        name: Cool down

scenarios:
  - name: Spaceflight News
    flow:
      - get:
          url: '/spaceflight_news'